InformationRegisters/СостоянияИРеквизитыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИРеквизитыДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоставитьПолностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазбиватьРасходныеОрдераПоРаспоряжениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазбиватьРасходныеОрдераПоРаспоряжениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИРеквизитыДоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#Область Обработчики_2_2_2

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт 
	
	ПолноеИмяОбъекта = Метаданные.РегистрыСведений.СостоянияИРеквизитыДоставки.ПолноеИмя();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияИРеквизитыДоставки.Распоряжение КАК Распоряжение,
	|	СостоянияИРеквизитыДоставки.Склад КАК Склад,
	|	СостоянияИРеквизитыДоставки.ПолучательОтправитель КАК ПолучательОтправитель,
	|	СостоянияИРеквизитыДоставки.Перевозчик КАК Перевозчик,
	|	СостоянияИРеквизитыДоставки.СпособДоставки КАК СпособДоставки,
	|	СостоянияИРеквизитыДоставки.Зона КАК Зона
	|ИЗ
	|	РегистрСведений.СостоянияИРеквизитыДоставки КАК СостоянияИРеквизитыДоставки
	|ГДЕ
	|	СостоянияИРеквизитыДоставки.УдалитьРазбиватьРасходныеОрдераПоРаспоряжениям
	|	И НЕ СостоянияИРеквизитыДоставки.РазбиватьРасходныеОрдераПоРаспоряжениям";		
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", ПолноеИмяОбъекта);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить(), ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = Метаданные.РегистрыСведений.СостоянияИРеквизитыДоставки.ПолноеИмя();
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Распоряжение", 			Выборка.Распоряжение);
			ЭлементБлокировки.УстановитьЗначение("Склад", 					Выборка.Склад);
			ЭлементБлокировки.УстановитьЗначение("ПолучательОтправитель", 	Выборка.ПолучательОтправитель);
			ЭлементБлокировки.УстановитьЗначение("Перевозчик", 				Выборка.Перевозчик);
			ЭлементБлокировки.УстановитьЗначение("СпособДоставки", 			Выборка.СпособДоставки);
			ЭлементБлокировки.УстановитьЗначение("Зона", 					Выборка.Зона);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Набор = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
			Набор.Отбор.Распоряжение.Установить(Выборка.Распоряжение);
			Набор.Отбор.Склад.Установить(Выборка.Склад);
			Набор.Отбор.ПолучательОтправитель.Установить(Выборка.ПолучательОтправитель);
			Набор.Отбор.Перевозчик.Установить(Выборка.Перевозчик);
			Набор.Отбор.СпособДоставки.Установить(Выборка.СпособДоставки);
			Набор.Отбор.Зона.Установить(Выборка.Зона);
			Набор.Прочитать();
			Если Набор.Количество() = 0 
				Или Набор[0].РазбиватьРасходныеОрдераПоРаспоряжениям 
				Или Не Набор[0].УдалитьРазбиватьРасходныеОрдераПоРаспоряжениям Тогда
				ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
				ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
				ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяОбъекта;
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор, ДополнительныеПараметры, Параметры.Очередь);
			Иначе
				Набор[0].РазбиватьРасходныеОрдераПоРаспоряжениям = Набор[0].УдалитьРазбиватьРасходныеОрдераПоРаспоряжениям;
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
				
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось перезаписать движения в регистр %ИмяРегистра% по группе измерений ""%ГруппаИзмерений%"" по причине: %Причина%'");
			ГруппаИзмерений = Новый Массив;
			ГруппаИзмерений.Добавить(НСтр("ru = 'Распоряжение:'") 			+ Символы.НПП + Выборка.Распоряжение);
			ГруппаИзмерений.Добавить(НСтр("ru = 'Склад:'") 					+ Символы.НПП + Выборка.Склад);
			ГруппаИзмерений.Добавить(НСтр("ru = 'ПолучательОтправитель:'") 	+ Символы.НПП + Выборка.ПолучательОтправитель);
			ГруппаИзмерений.Добавить(НСтр("ru = 'Перевозчик:'") 			+ Символы.НПП + Выборка.Перевозчик);
			ГруппаИзмерений.Добавить(НСтр("ru = 'СпособДоставки:'") 		+ Символы.НПП + Выборка.СпособДоставки);
			ГруппаИзмерений.Добавить(НСтр("ru = 'Зона:'") 					+ Символы.НПП + Выборка.Зона);
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ГруппаИзмерений%", СтрСоединить(ГруппаИзмерений, "; "));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяРегистра%", ПолноеИмяОбъекта);
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
									УровеньЖурналаРегистрации.Предупреждение,
									Метаданные.РегистрыСведений.СостоянияИРеквизитыДоставки,
									Выборка.Распоряжение,
									ТекстСообщения);
			
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;
	
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
